## What is Python Pandas?
* Pandas is a Python module that makes Data Science easy and effective.
* It is a Python package that provides fast, flexible, and expressive data structures designed to make working with "relational" or "labeled" data both easy and intuitive. 

URL: https://pandas.pydata.org/pandas-docs/stable/

### Example - Weather Data

**Questions?**

1. What was the maximum temparature in New York in the month of January?
2. On which days did it rains?
3. What was the average speed of wind during the month?

In [1]:
import pandas as pd

In [2]:
# creating a dataframe
df = pd.read_csv('nyc_weather.csv')

In [4]:
df.head(10)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

**Answers:**

In [5]:
# 1. get the maximum temparature
df['Temperature'].max()

50

In [6]:
# 2. to know which days it rains
df['EST'][df['Events'] == 'Rain']  #boolean expression

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [7]:
# 3. average speed of the wind
df['WindSpeedMPH'].mean()

6.892857142857143

## Introduction to Pandas Dataframe

Dataframe is a main object in Pandas. It is used to represent data with rows and columns.

Dataframe is a data structure that represents the data in tabular or Excel spread sheet like data.

#### Creating dataframe:

In [8]:
# read weather.csv file
df = pd.read_csv('weather_data.csv')

In [9]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [10]:
# another way to construct a dataframe

# list of tuples
weather_data = [('1/1/2017', 32, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, 2, 'Snow'),
                ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', 31, 2, 'Sunny')]

df = pd.DataFrame(weather_data, columns=['day', 'temperature', 'windspeed', 'event'])

In [11]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [12]:
# get the dimension of the dataframe
df.shape

(6, 4)

In [13]:
# if we want to see initial sample rows (default 5 rows)
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [14]:
# if we want to see the last few rows (default 5 rows)
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [15]:
# slicing the dataframe
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [16]:
# names of columns in a dataframe
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [17]:
# print data from one specific column
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [18]:
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [20]:
# print data from more than one column
df[['day', 'event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [22]:
# print all the temperature data
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [23]:
# print max temperature
df['temperature'].max()

35

In [24]:
# print min temperature
df['temperature'].min()

24

In [25]:
# Initial summary statistics for a specific column
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [26]:
# select rows which has maximum temperature
df[df['temperature'] == df['temperature'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [27]:
# select only 'day' column which has maximum temperature
df['day'][df['temperature'] == df['temperature'].max()]

1    1/2/2017
Name: day, dtype: object

## Key Operations on Dataframe

### Read and Write CSV and XLS Files

In [28]:
df = pd.read_csv('weather_data.csv')

In [29]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [30]:
# Install: pip3 install xlrd

# read Excel file
df = pd.read_excel('weather_data.xlsx')

In [31]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [32]:
# write dataframe to CSV
df.to_csv('new.csv')

In [33]:
# to remove the first column which has index values
df.to_csv('new_noIndex.csv', index=False)

In [35]:
# Install: pip3 install openpyxl

# write dataframe to Excel
df.to_excel('new.xlsx', sheet_name='weather_data', index=False)

### Group By

In [36]:
# weather by cities
df = pd.read_csv('weather_data_cities.csv')

In [37]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [45]:
group1 = df.groupby('city')

In [46]:
print(group1)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000027ECD2DAB20>

In [47]:
for city, group in group1:
    print("City:", city.upper())
    print(group)
    print("***********************************************************")
    print("\n")

City: MUMBAI
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
***********************************************************


City: NEW YORK
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
***********************************************************


City: PARIS
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy
***********************************************************

In [48]:
# to get the data from a specific group
group1.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [49]:
dir(group1)

['__annotations__',
 '__class__',
 '__class_getitem__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__orig_bases__',
 '__parameters__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_agg_examples_doc',
 '_agg_general',
 '_agg_py_fallback',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_with_numba',
 '_apply_allowlist',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_bool_agg',
 '_cache',
 '_can_use_transform_fast',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_general',
 '_cython_transform',
 '_define_paths',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_hidden_attrs',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_protocol',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_wrapper',
 '_numba_prep',
 '_obj_1d_constructor',
 '_obj_with_exclusions',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_resolve_numeric_only',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_with_numba',
 '_wrap_agged_manager',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_applied_output_series',
 '_wrap_transform_fast_result',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'city',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'day',
 'describe',
 'diff',
 'dtypes',
 'event',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sample',
 'sem',
 'shift',
 'size',
 'skew',
 'std',
 'sum',
 'tail',
 'take',
 'temperature',
 'transform',
 'tshift',
 'var',
 'windspeed']

In [51]:
# find the maximum temperature in each of the cities (for numeric attributes)
print(group1.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [52]:
# average for each of the cities (for numeric attributes)
print(group1.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [54]:
# summary statistics for each city (for numeric attributes)
print(group1.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

## Concatenate Dataframes

In [55]:
india_weather = pd.DataFrame({"city": ["Mumbai", "Delhi", "Banglore"],
                              "temperature": [32, 45, 30],
                              "humidity": [80, 60, 78]})

print(india_weather)

       city  temperature  humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78

In [56]:
us_weather = pd.DataFrame({"city": ["New York", "Chicago", "Orlando"],
                           "temperature": [21, 14, 35],
                           "humidity": [68, 65, 75]})

print(us_weather)

       city  temperature  humidity
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [57]:
# concatenate two dataframes
df = pd.concat([india_weather, us_weather])

print(df)

       city  temperature  humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [59]:
# to get the continuous index
df = pd.concat([india_weather, us_weather], ignore_index = True)

print(df)

       city  temperature  humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3  New York           21        68
4   Chicago           14        65
5   Orlando           35        75

In [60]:
# row wise concatenation
df = pd.concat([india_weather, us_weather], axis = 1)

print(df)

       city  temperature  humidity      city  temperature  humidity
0    Mumbai           32        80  New York           21        68
1     Delhi           45        60   Chicago           14        65
2  Banglore           30        78   Orlando           35        75

## Merge Dataframes (Similar to Join in SQL)

In [61]:
temperature_df = pd.DataFrame({"city": ["Mumbai", "Delhi", "Banglore", "Hyderabad"],
                               "temperature": [32, 45, 30, 40]})

print(temperature_df)

        city  temperature
0     Mumbai           32
1      Delhi           45
2   Banglore           30
3  Hyderabad           40

In [62]:
humidity_df = pd.DataFrame({"city": ["Delhi", "Mumbai", "Banglore"],
                            "humidity": [68, 65, 75]})

print(humidity_df)

       city  humidity
0     Delhi        68
1    Mumbai        65
2  Banglore        75

In [63]:
# merge the two dataframes without explicitly mentioning the index (non-matching rows will be dropped)

# INNER-JOIN
df = pd.merge(temperature_df, humidity_df, on = 'city')

print(df)

       city  temperature  humidity
0    Mumbai           32        65
1     Delhi           45        68
2  Banglore           30        75

In [64]:
# if we want to retain the non-matching rows as well

# OUTER-JOIN
df = pd.merge(temperature_df, humidity_df, on = 'city', how = 'outer')

print(df)

        city  temperature  humidity
0     Mumbai           32      65.0
1      Delhi           45      68.0
2   Banglore           30      75.0
3  Hyderabad           40       NaN

## Numerical Indexing (.loc vs .iloc)

**Default Indexing**

In [65]:
df = pd.DataFrame([1, 2, 3, 4, 5, 6, 7, 8, 9, 19])

print(df)

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  19

**User Defined Indices**

In [68]:
df = pd.DataFrame([1, 2, 3, 4, 5, 6, 7, 8, 9, 19], index = [49, 48, 47, 46, 45, 1, 2, 3, 4, 5])

print(df)

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [73]:
# get the data at index 46 (user defined custom index)
df.loc[46]

0    4
Name: 46, dtype: int64

In [70]:
# get the data at row 3 (default index)
df.iloc[3]

0    4
Name: 46, dtype: int64

In [74]:
# get all the values until index 2 (user defined index)
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [75]:
# get all the values until row number 2 (default index)
df.iloc[:2]

    0
49  1
48  2